[
  {
    "slug": "/01-09-2020",
    "title": "1 September 2020",
    "description": "Waterfalls",
    "content": "The first spring rain is its own complete description.\n"
  },
  {
    "slug": "/02-09-2020",
    "title": "2 September 2020",
    "description": "Slow Salaat",
    "content": "Paul and I walked around the garden twice today after the rain had eased up and took photos for the website. Many plants are in bloom, and many of the flowers were holding pristine drops of silver water. Truly, *rahma* is everywhere.\n\nSo much happens each day, and I have so little to say about it.\n\nAfter our walk, we sat on the benches near the pond and I fell into deeper meditation. It was around sunset, so I began doing *Maghreb* in my imagination - not moving a muscle, but carefully following each incantation and embodied movement through its proper course. What it felt like to move through each cycle!\n\nPaul looked at me afterwards and called it “windows into Reality”, which was both perfectly timed and about as well put as it can be. It’s like being totally transparent.\n\nThe sense of overwhelming light, being broken into a release and relief beyond measure, and then the completely full compassion required to come back and keep pretending: there is no way to quantify all this in any sentence.\n\nWe walked home quietly and made some coffee. The full moon finally broke through the clouds right as we stepped out of the kitchen, steaming cups cradled in our hands.\n"
  },
  {
    "slug": "/03-09-2020",
    "title": "3 September 2020",
    "description": "The Mirror",
    "content": "We spent most of the day today with Aaron working on the website. He’s such a gentle and loving soul. I care for him deeply and unexpectedly.\n\nWhile he took a call, Paul and I went for another walk. We did our usual round and came back to the benches once again to sit quietly. Each day is fresh and unique and utterly itself, so I wasn’t trying to repeat or go back to what had happened yesterday. It felt softer and more gentle and I just washed away in the birdsong and quiet breeze.\n\nAt some stage in the stillness, it was as if the gate of ego opened up. I saw this which must die for what it is and felt a wave of gratitude wash over me. It wasn’t overwhelming like yesterday, but it had somehow the same depth to it. I’m just incredibly grateful to be who I am, with all my flaws and limitations and the endless arrogance and ego I have to constantly catch myself in.\n\nAfter this, I sat quietly waiting for Paul. We both eventually got up to meet Aaron, and SFH appeared at the same time, “on a mission.” He looked at us both, thanked us for being there, and made the point that whatever we do, we ultimately do it for our own self. This felt particularly apposite given what had just happened on the benches. He went on to make the point that all we have to do is get rid of the illusion that we have got something. We may have understood a tiny, little, insignificant bit, but the truth is that whatever we think we’ve got, it’s really got us. We thank the ego for holding this small little bit, and then we dissolve laughing into that which can never be known by the limited and conditioned mind.\n\nHe then had a striking exchange with Aaron, which went something like this:\n\nAaron: The website is beginning to look good and we’re making great progress. \\\nSFH: Good. It could’ve been done a long time ago though. \\\nAaron: No, it couldn’t have Shaykhna. You were not ready. \\\nSFH: I was not ready!? No. The people were not ready for a true mirror. ‘Do you know that you don’t exist? Have you realised yet that you are an illusion?’ Nobody could handle that.\n\nThe conversation meandered on a bit, with SFH asking Aaron to get him some “sugar melons”. There is no such thing, but “it’s really about hope. We need hope to occupy the mind, so that it can be satisfied and come to neutrality. Only then can we go beyond.” He also told a story about Dr Z bringing him some watermelons (a summer fruit) on winter solstice and bemoaned this idiocy. He joked about how he couldn’t even eat them, because they’re God (referring to an old Sufi story about a god-king melon).\n"
  },
  {
    "slug": "/04-09-2020",
    "title": "4 September 2020",
    "description": "Silent Dhikr and a Web of Wonder",
    "content": "Paul and I shared a beautiful lunch today which we made. Then I sat quietly in the sun for a while and, after digesting a bit, went upstairs for *Jumah*. My intention was clear, but not a word or even a feeling. Not even ‘truth’ any more.\n\nI then sat outside as we rose into the afternoon sun, slowly shifting its warmth across the balcony and did a silent dhikr. I remember how I died.\n\nI exploded in the light, and the wind sang through the palm fronds, and two fish eagles called to each other in their singular, signature tune of African yearning. I think that - like the owls - they’re getting ready to nest and procreate.\n\nI understand nothing. Everything is perfect.\n\n*\"The Lords of love are in love ensnared, \\\nBewildered\"* - Ibn 'Arabi\n\nLater in the day, Aaron, Mary, Paul and I met with SFH to review the website. There is so little to say about the hour and half we got to spend together. I sat next to SFH for the duration of the meeting, walking him through the work we’ve done, listening to various bursts and beams from him, recording what I could, and generally just flowing in the love and presence which permeates everything at all times, but is particularly obvious around him.\n\nMost of what he related had to do with the ever-lasting light within every heart, the unnecessary nature of any path or religion or ritual, and the need for a balance between head and heart. The rest of what we worked through can be found in [this commit](https://github.com/SFH-Foundation/sfhfoundation/commit/d7db5cacefd13b9a54ab110bb68e3dba6c4c8af8) and in the two audio recordings I was gifted.\n\nThere’s only one other story worth relating here. At one stage, he looked at me and said, “It’s all transient. Everything is transient: he, she, you, me. Every I passes on. Yet I know this because there is a permanent light whose shadow I am. I know my temporary self because of the eternal soul. **It’s so simple**!”\n\n“Go back to zero and be \\\nat One.”\n\n***\n\nLater still, the now-waning moon peeking out occasionally from behind more clouds, Paul and I sat quietly on the downstairs balcony beneath the chandelier. He seemed to be a bit down over dinner (Mary’s veggie soup, bread, halloumi and SFH’s gift of tulsi, which is entirely unlike anything I have ever tasted before), and I felt the desire to be transparent again.\n\nHowever, there is a great subtlety in this: it’s not you pushing all your own illusions and shadows onto others: it is a transparency that is contained. On realising this, *ayat al-nur* came, and there is nothing more to be said.\n\nWe cannot ever deny this world, nor can we hastily and without care return our life in it to its source. However, it is not attachment to this world (about which we are neutral) which makes us hesitate: it is recognition of the unmeasurable value of the gift of a life in it. You can only give it back once you know its infinite worth, have tasted the joy of death, and are entirely content if it is received or if you are told to keep waking for a little while longer.\n"
  },
  {
    "slug": "/05-09-2020",
    "title": "5 September 2020",
    "description": "The Gift of No Address",
    "content": "Paul and I went for a morning walk around the farm and, as we were about to return to Andalus, received a message from Luna to join in a Zoom call that SFH was on, answering some questions from a young woman. We found Aaron, Grace and Mama Zee on the veranda with him and sat down quietly to listen. He was in his usual form, speaking about many of the things we have discussed over the last weeks in an ever more distilled and direct manner. A lot of the discussion revolved around the need for a balance between head and heart, and he gave a particularly stark answer to the question of how to talk about submission or slavery in a way more acceptable and accessible to the modern mind.\n\n“There is only submission. Whether you submit to your soul or the outer desires which colour it, we are all in submission all of the time. The entire universe is constantly in worship, whether any specific part of it is aware of it or not. The only seeming choice we have in this life is whether we surrender to our temporary and transient desires, or the eternal and infinite within which is the spark that ignites them. Any desire is really just the outer shell of this inner truth, so the difference has not to do with whether we submit or not. It arises based on the direction of our intention when choosing what to submit to. In any case, we’ll all realise this once we die.”\n\nSFH used this point to illustrate something profound about the nature of higher consciousness, our responsibility here (which is to care for and place appropriately the lower self) and how to achieve ever finer balance between mind (which changes) and heart (our constant connection to the Absolute): “You don't need to know the address of Number 1 in the cosmos: higher consciousness is taking care if itself. You just need to stop addressing anything else.”\n\nAfter the talk was finished, we spoke for a while, and then I moved off with Grace to sit in the sun by the pond. There is a small waterfall which makes a delightful noise and the birds were singing their hearts out in praise, as always. Grace, being Grace, enquired after me and my parents and how the last few months of lockdown had been for all of us. She asked me what I had been thinking about and working on most closely. The answer I gave was about the gift and gift-giving: in particular what I had learnt from Kernel and the Diamond Sutra about how a real gift can only be given by a bodhisattva who does not believe in objects; who knows that what the Buddha taught as being is no-being, hence it is being.\n\nWe discussed Rumi’s idea of “Without cause, God has given you being. Without cause, give it back” and what the moment of that giving back is truly about. It is not a denial of this world; it is not given back out of exasperation or sullen abandonment, it is not a giving up: it must come from a true appreciation of the infinite value of a life in this world that is simultaneous with the realisation that it is not your life. It is just life, forever. It is eternal and infinite and we all stand as receivers in relation to it. In truth, there is no giving at all. There is just alignment with the flow of endless generosity.\n\nThis generosity is so great that we are actually the receivers of two gifts: the ability to be conscious in this world and see the perfection of every single moment, and then the gift of endless light once our very temporary and insignificant time here is up. Even if the moment seems to be one of pain or suffering, there is still only perfection in it: for we are also given the gift of not just seeing form, but the meaning behind it.\n\nIn order to illustrate this, Grace pointed across the pond at a yesterday-today-tomorrow. “This bush is telling us about the flow of time, but it is doing so by virtue of the timeless Reality within it and around it; in front of it and behind it. I can see the white, lilac, and purple blooms, and I can know about the past, the present, and the future. But I also know that there is only the eternal Now of which both bush and me are a part, participating in the endless self-disclosure of what is neither bush nor me, but gives us both life and light.”\n\nWe spoke a little about her own writing and upcoming book, about the sea and the horizon and growing up in paradise (literally the Paradise Islands in Hawaii). We noted the critical importance of honesty: a deep and wide, endlessly honest and courageous examination of who you really are, and all your local and particular experiences, until you reach a point where you discover there is no you and what you thought was you does not exist. It is from this point that the universal flows. It is the void at the heart of the self which is transmissive. Therefore, it is not me who is universal; it is not me who carries any message; it is not me who can write the real meaning of what it is to sit by a small koi pond listening to the sound of a waterfall playing with sunlight and speak sincerely with a companion of the heart.\n\nLater that evening, after a dinner of leftovers from Aaron and Luna, Paul and I sat quietly. We had heated them up in a silver oven tray, and there was a little bit of oily gravy stuck to the pan which I still need to go and clean after finishing this. So much of this work seems to be about truly experiencing submission to the soul, with an intention that places one at just the right angle to see through the illusion of self and therefore align with the generosity which is from God, by God, through God, and back to God. If this state is held in the heart, then there is no difference between writing poetry and cleaning dishes: both are just limited ways of expressing artfully the same infinitude.\n\nThe fact I sat for half an hour in stunned silence and watched the light become ten thousand rainbows in a scraped oven pan full of oily gravy is but one more, meaningfully empty, example of this.\n"
  },
  {
    "slug": "/06-09-2020",
    "title": "6 September 2020",
    "description": "Worship and Words",
    "content": "I find it difficult to write about the last few days at the farm. I’ve put it off until arriving home to try and gather the courage to write it out as truly as I can.\n\nWe had another meeting with SFH to review the site again this morning. I asked him specifically about the “Pointers to Practice” section, and he gave us two recordings on practice and - more specifically - “stillness”. To sit in the stream of those recordings, eyes closed with him as he went into his state and spoke from the heart, was more than words can hold. The intensity of such moments exceeds any description, any expectation, any concept.\n\nWe didn’t talk too much more about the website after these recordings. Yuval came, and related the story of how SFH and he had met 25 years ago when SFH had just arrived in South Africa. He spoke a little about Keys and some of SFH’s work that he particularly enjoys. It was a welcome break from the intensity we had just experienced, but there is also a bereftness to leaving that zone and existing again within space and time. They go together: the relief and the agony; the knowing and the doubt; the light and its shadow.\n\nI felt utterly drained afterwards. We had brunch with the family - I sat with Mary and Mama Zee and Grace. There was - in particular - a loaf of polenta bread to die for. We went back to Andalus after some further conversations with Grace and SFH, of which I wasn’t really a part. The only thing that stood out was Yuval going to fetch a copy of Keys and reading a few ayat. Grace remarked, “Oh love, you were on such illuminated fire then, when you were writing those *tafsir*!” To which he responded simply, “Yes. It was a nice barbecue.”\n\nPaul and I went back to Andalus and I just lay on the grass in the sun and surrendered myself to that little patch. There’s something wonderful in feeling supported by each blade and asking permission of all the little yellow flowers, placing your legs and feet carefully so as not to crush any of them. Of course, there is gotu kola growing all around, which somehow adds to the ambience of serenity.\n\nDavid came around a little later with some questions about my experience of SFH, so he could “check himself”. All I told him is what Aldous Huxley says in *The Perennial Philosophy*: the language gives it all away. To be “checked” means to be stopped. The whole story is really about stopping yourself. Can you, no matter what is happening, stop dead right now? Can you do so joyfully? Can you die, over and over and over: knowing that the intensity of the moment - this eternal moment where I am writing and you are reading and which is not separate, ever - arises from the very simple fact of constant creation and destruction? Birth and death are like the pedals on a bicycle which moves on forever.\n\n“So, why does the teacher speak at all?” David asked. \\\n“Because he has no choice,” Paul responded. \\\n“Because it is worship,” I said.\n\nWorship at its most intense and potent is always sacrificial. It’s Abraham in the fire, refusing to ask Gabriel for mercy, and then again refusing to ask his Lord through Gabriel, because “It is enough for me that my Lord knows where I am.”\n\nIt is enough.\n\nTo speak is to enter time - because language is always already within time - and so this is the ultimate sacrifice for a being who knows that time does not exist. Who knows that we carry a light which is timeless and boundless, and yet which shines truly in response, as a reflection of its own self-disclosure. And so he reflects, his hands empty, his heart overflowing, his words the fire in which he burns, content that his Lord knows where he is.\n\nJust this is enough.\n"
  },
  {
    "slug": "/07-09-2020",
    "title": "7 September 2020",
    "description": "Dream Come True",
    "content": "The reason it’s been so difficult to write these last few days down has to do with my own shadows. I’ve very consciously only written about the most striking and light aspects of my visit here, but this - of course - only reflects half the story. In this world, everything comes in twos and you cannot deny any of it if you want to be a fully alive human being. The duality must be seen and responded to. The nature of the response is informed by the degree to which you can see the one behind the two in every single moment, but this does not nullify the conditioned and limited experience of duality. It is both/and, then beyond.\n\nSo, what is my shadow? It has been particularly intense between Paul and I these last two weeks. We have shared many long silences; some of them unutterably beautiful, some of them genuinely difficult. I have been forced to look at, in exquisitely minute and excruciating detail, my desire to fit in; to be loved and acknowledged. My guess is that most people have this, as we are social creatures. However, it is particularly strong with me. I’ve seen that this is because it’s not just a desire to be accepted and acknowledged that I have, but to be *admired*. This then bleeds into a competitive edge I find difficult to see, catch and tether, or a certain kind of attention to conduct and courtesy that actually becomes obsequiousness. It’s such a fine line to tread; that between proper courtesy and irritating imitation and obsequiousness. I am sure Paul felt frustrated with me on more than one occasion when I got this wrong.\n\nWhat’s most difficult about this kind of work is that the desire to be courteous and correct is not necessarily a bad thing. In a sense, it is easier to deal with obvious shadows and bad habits, but what about the lights that still veil us from truth; from perfect presence in every instant? Just like *shirk* is that shadow-side of *tawhid*, obsequiousness is the shadow-side of courtesy and this smashed me. There is nowhere to run to, no escape from seeing once you set an intention to look as truly as you can at all the shadows and light you carry. Instead of detail the rest of what happened today (not much, except for a long and repetitive conversation with Mama Zee on the benches at sunset which was all about compassion), I will describe a dream I had here on the second night which foreshadowed all of this work.\n\nMy sleep here has been mostly clear and untroubled. The only flash I’ve had involved a situation playing out in what seemed to be a school of some kind. Though the details are fuzzy, there was a group of us moving through the corridors, and our task was to move a body in one grave to another site attached to a different classroom, where it was to join another. Both bodies seemed to be war heroes of some kind.\n\nThere was an old woman directing operations and, though her exact personality was unclear, she seemed to be a mix between Mary and another woman. She was full of light, and seemed pleased by our efforts to get the graves in order. She seemed set to embrace me once the task was complete, but then a shadow appeared from nowhere and totally engulfed me in the single most terrifying, but also the warmest, embrace I have ever experienced. It spoke to me from the heart of its overwhelming darkness: “Serve the balance.”\n\n“I swear to,” I responded, instinctually. The dream ended.\n"
  },
  {
    "slug": "/08-09-2020",
    "title": "8 September 2020",
    "description": "Once More Into The Light",
    "content": "We left the farm today after coffee and one more slice of cake with Mary and SFH. It was such a striking mood to find (and leave) him in. He began the discussion by telling us that it was all just generosity - the whole thing. His own life has just been a reflection of gift upon gift upon gift, and so these two weeks of sharing with us is just one more, small expression of that overarching theme, or “arc of consciousness” as he likes to say. In a sense, all the “rise in consciousness” really means is an increasingly broad and deep awareness of the overflowing mercy of this governed universe.\n\nWe moved to more comfortable couches after coffee and began a last little bit of work on his biographical data for the website. He wanted to add a sentence or two about the orchards in Karbala from which they got all of their fresh produce, especially his favourite item: pomegranate. He spoke in surprising detail about his love for these fruits. It was sweet and human and local and I could almost sense what it was to walk through those orchards on a tributary of the Euphrates and smell the spring blossoms which are still echoed here in the Lowveld of South Africa because the world is strange and wonderful.\n\nHe emphasised - as we went through these very local and personal threads of his life - that this place was somewhere you come to be humble. After taking me on this long journey through the universe, where - in truth - self does not exist; where there is no time and no space; where there just is: we now landed back - via a few pomegranates growing in a Karbala lost in the sands of time - in a place where you can’t deny any of it. We must live and respond as honestly and humbly as we can to the situations that present themselves to our local, limited and particular awareness if we are ever to sense that which is limitless, if we are ever to touch the timeless and learn how to live completely in tune with it; present and therefore with the perfection of this very instant, even if its expression in time seems to pass.\n\nThe drive home was surprisingly challenging. It’s not easy to leave the orbit of the farm. However, we made it back to Johannesburg without incident. After *salaat*, Paul and I sat down to dinner - veggie and bean curry and rotis - and a pot of tea Paul made. It was late and we drank the tea in reflective silence after a long discussion about all that had happened at the farm, our favourite moments with SFH, and some reflections about the nature of true teachers. They always point away from themselves, because they know that it is not them, but Reality through them and that any spotlight cast on the biographical person dims the purity of the light which is not theirs.\n\nAs the tea percolated through us, silence returned. I once more became caught in the refraction of lights through the little bit of water left in a glass on the table in front of me. Eventually, it became too bright to bear and my eyes closed of their own accord. I sank and sank and sank, and soared and soared and soared. I felt everything I think I am dissolve, beginning with my back: all of it just floating away in tiny little fragments. In an image I’ve seen often in *sajda* and meditation before, I stepped out from behind the dark wall and faced the light, not out of arrogance, but simply because that is what it demanded of me, and I was blown to pieces.\n\nThis occasion, unlike previous ones, I genuinely felt it - the image itself shattered, and there was no longer a self stepping out; there was no longer light; there was no longer anything to be blown apart.\n\nWhat is the nature of such an experience? Of course, such a question cannot arise there, hence the sacrifice required to come back here and ask it, even though the knowledge one seeks is implicit already in the way the question is phrased: no nature, therefore natural.\n\nThis description can make it seem like I am the one who chooses to “come back here”, that somehow I am magnanimous and noble and compassionate, which is obviously not at all the case. It is really just the flow of Reality which turns our hearts this way and that, without anyone really understanding how or why. All we can hope for is given in the words of Ishmael as he follows his father up the mountain to be sacrificed: “I trust you will find me patient.”\n\nPaul had read the English translation of “The Departure of Illusion” just prior to this, and it was this verse which stood out most for me:\n\n*It obtained a secret and a path of balance. Few of the people of perfection have tasted it. \\\nOur Lord, bless the light - every slave who goes to it attains his desire.*\n"
  },
  {
    "slug": "/09-09-2020",
    "title": "9 September 2020",
    "description": "The Meaning of One God",
    "content": "I left early this morning to drive all the way back down to Cintsa, needing to arrive this evening so as to receive instruction tomorrow from my parents about how to look after the house and the plants and the sewage system while they are away. It was an even harder drive than yesterday.\n\nI hit a mongoose which ran out into the road and then stopped in terror as it realised its miscalculation. I wasn’t fully aware at the time and still feel terrible about it. What a mess we are, us human beings. There is always a price to be paid: “the beauty and the cost” as Paul puts it.\n\nEventually, I stopped at a  picnic spot outside Komani, in the mountains. I ate an amazing veggie roti roll, laid out my prayer mat facing one of the great rock faces and disappeared into *salaat*, followed by a long *dhikr* on the grass as all the trucks and traffic rolled past. I put myself in the mongoose’s position and apologised from my heart and sang of my sadness for yet another slip, for yet another mistake, and all the many lessons I still have to learn.\n\nNo great light descended and no burden was lifted, but it was soft in that grass and the wind blew as I chanted the final chorus, and a few birds flew overhead once I returned to silence, singing their own version, and one cricket joined me all the way through. I read a poem of SFH’s which I’ll include below, and sat quietly for a little while, before finally getting back in the car and continuing on.\n\nI tried to put on a CD of *dhikr* from SFH entitled “The Meaning of One God.” The car’s CD player accepted it and displayed “Track 1”, but then seemed to get stuck and it just played pure silence. At first, I was a little impatient, but then the vastness of this truth dawned on me.\n\nI drove home, drenched in silent meaning. This life is awfully funny.\n\n***\n\n*Time has come, \\\nhonoured by afflictions. \\\nNo refuge, \\\nno respite, \\\nonly patience, \\\nor death-perfecting stillness. \\\nNearest to source, \\\nabsolute, \\\nconstant. \\\nThe origin of every instant! \\\nKnown to us, \\\nwho live here \\\nin life itself.*\n"
  },
  {
    "slug": "/15-11-2020",
    "title": "15 November 2020",
    "description": "Complete Cosmic Circle",
    "content": "I have been back to the farm on another two occasions, one just a month after the above was written, and again more than a year later. Both were unique and revealing in their own ways. Courage, honesty, and balance remained central themes, explored and revealed in ever more refined ways on each occasion.\n\nI did not keep as detailed an account of either visit: it was not what my heart required of me. However, I record here an exchange between SFH and Dr A from the beginning of a live broadcast about Surah An-Najm. I think it is likely the most accurate, insightful, humorous, and *living* summary of what I have written above. I attempted one inner description of this event in poetry, which can be found [here](https://unifying.thebluebook.co.za/?stackedPages=%2Fcircle\\&stackedPages=%2Feternal).\n\n**SFH**: *Bismillah.* Dr A, I need your permission.\n\n**AA**: \\[laughs]\n\n**SFH**: I really mean it! *Sidrat al-muntaha*: is it equivalent to the event horizon?\n\n**AA**: \\[pauses]\n\n**SFH**: I am glad! I caught him unaware! He hadn’t thought of that before, so it must be something very special. \\[laughs]\n\n**AA**: I think so, yes. As it says: “beyond that, there is no beyond”.\n\n**SFH**: There you go! Brilliant! Thank you: you have made my day. I don’t need to do anything any more. Goodbye!\n\n**LK**: \\[info on the session]\n\n…\n\n**SFH**: Oh, I have *Sidrat al-muntaha* answered, I have looked at Dr A, I have people waiting for something (I don’t know what). I’ve got enough!\n\n**AA**: Shaykhna, maybe before everyone comes out, this *Najm* is such an amazing surah. Especially the issue about وَٱلنَّجْمِ إِذَا هَوَىٰ (“By the Star when it goes down”), or even the one about فَكَانَ قَابَ قَوْسَيْنِ أَوْ أَدْنَىٰ (“And was at a distance of but two bow-lengths or nearer;”). Maybe I could have your permission? I think that the way in which this makes the most sense is that these “two bow-lengths” really have to do with particular kinds of measurement associated with the human body. You know, Arabs like my mother, when they took a measure, they did this (Dr A indicates the length of his forearm). So, when I take a measure - or these two measures indicated here - I am bringing him nearer and hugging him (Dr A is clearly imagining his mother encircling him as a child with her arms).\n\n**SFH**: Before COVID, you could do that, because you could embrace another. When you do so, it becomes a circle. But, with COVID, they broke it. You can’t connect anymore: in between them, there is a gap.\n\n**AA**: Yes, exactly! So فَتَدَلَّىٰ (“nearer”) was that He (Allah) closed the circle around him (the Prophet (pbuh)) such that there is no more him and his Lord.\n\n**SFH**: Brilliant, correct!\n\n**AA**: Because the قَوْسَيْنِ (“measure” or “bow-lengths”) making some kind of bow does not make sense otherwise.\n\n**SFH**: Neither does فَتَدَلَّىٰ (“nearer”)... It was a circle, but in between - because of the feebleness of our mind - we see a gap.\n\n**AA**: Yes! Because he is saying, ثُمَّ دَنَا فَتَدَلَّىٰ (“Then he approached and came closer”), as in He (Allah) brought him (the Prophet (pbuh)) close, like picking up a child. You have to close the circle around the child when you pick them up.\n\n**SFH**: It is the feebleness of the mind which gives us the illusion of separation (in the circle). In truth, the whole thing is a complete cosmic circle.\n\n**AA**: And He is the centre of the circle!\n\n**SFH**: Everywhere is the centre of the circle! Because the circle moves.\n\n**AA**: That’s it! *Subhanallah*.\n\n**SFH**: Wherever It is, is the centre.\n\n**AA**: Yes! Because otherwise how can فَأَوْحَىٰٓ إِلَىٰ عَبْدِهِۦ مَآ أَوْحَىٰ (“Allah convey the inspiration to His Servant”), unless there is only One?\n\n**SFH**: Yes. It means that there is no *abd* (slave) and there is no *mawla* (master). There is only the One and only One, but you have to give up everything before you enter into That.\n\n**AA**: Yes! And that is, as you said, *Sidrat al-muntaha*: the event horizon. That’s it! It’s finished.\n\n***\n\n## SINGULARITY\n\n*by Marie Howe* \\\n*(after Stephen Hawking)*\n\nDo you sometimes want to wake up to the singularity \\\nwe once were? \\\n\\\nso compact nobody \\\nneeded a bed, or food or money — \\\n\\\nnobody hiding in the school bathroom \\\nor home alone \\\n\\\npulling open the drawer \\\nwhere the pills are kept. \\\n\\\n*For every atom belonging to me as good \\\nBelongs to you.*     Remember? \\\n\\\nThere was no     *Nature.*     No \\\n     *them.*     No tests \\\n\\\nto determine if the elephant \\\ngrieves her calf     or if \\\n\\\nthe coral reef feels pain.     Trashed \\\noceans don’t speak English or Farsi or French; \\\n\\\nwould that we could wake up     to what we were \\\n— when we *were* ocean     and before that \\\n\\\nto when sky was earth, and animal was energy, and rock was \\\nliquid and stars were space and space was not \\\n\\\nat all — nothing \\\n\\\nbefore we came to believe humans were so important \\\nbefore this awful loneliness. \\\n\\\nCan molecules recall it? \\\nwhat once was?     before anything happened? \\\n\\\nNo I, no We, no one. No was \\\nNo verb       no noun \\\nonly a tiny tiny dot brimming with \\\n\\\n*is is is is is* \\\n\\\nAll  everything  home\n"
  },
  {
    "slug": "/22-08-2020",
    "title": "22 August 2020",
    "description": "Sunset Walk",
    "content": "Paul and I arrived in the early afternoon. The atmosphere here is electrically peaceful. After meeting David, Mary and later Aaron, we went for a walk with the dogs Zita and Zulfi.\n\nSFH appeared halfway through our stroll and we joined him. His first comment to me had to do with people looking for enlightenment, or some kind of attainment. There is none to be had.\n\nHe said that our age is not about your colour or creed or community: it is about *you*. Which is deeply selfish, but what is most selfish is also selfless, and this is the first key he offered me. Having realised this, there is simply peace. And with that peace comes both beauty and majesty, and a cautious awareness born of the unification of your selfish outlook with the realisation that there is no you.\n\nWe continued on our walk and SFH told us some of the history of the farm, as well as his own involvement with it. We meandered between the pecan nut trees and he had us harvest as many as we could find lying on the ground. He was incredibly sharp and attentive: much better at finding the camouflaged nuts in the dusk light than I was. He spoke a little about his family and how the children dispersing left him with less motivation to keep working on the farm.\n\nAs he leant down to pick up another pecan he opened his eyes widely, looked directly at me and said, “It’s all about honesty. 100% honesty!” It was like being hit by lightning.\n\nWho are you going to lie to if you don’t exist?\n\nWe carried on walking and he shared some generous words with Paul about being missed and how happy he was to see him again. He noted how kind Paul was to let SFH “nag” him all these years, “Which is really a kind of self accusation anyway”. He asked us to complete a project for him by researching some Quantum Mechanics and the most modern discoveries in order to use them as a gate for young people to understand Oneness. While discussing this he noted how the void, the emptiness, the nothingness is really inexplicably and utterly full, “buzzing with life”.\n\nWe began to round the house, now well after sunset; the horizon still red and gold, but the wider sky navy blue, moving into black. The new crescent moon was clearly visible above us, smiling in her silent rounds.\n\nSFH spoke a little about how they manage water - “water is really the heart of it, at the very core of any farm” - and then looked up and greeted the moon.\n\n“It is a dark rock, and yet it shines! How is that so?”\n\nThe question was directed at me. I was tongue-tied and had to admit ignorance. Why does the moon actually shine? I had never thought to ask such a simple question. He laughed, joked about how he was “seeking knowledge” and what help were we? He pretended to be disappointed. We continued up and around the house to take in the vista over the valley where the sun had set, the whole world purely and vibrantly and brilliantly alive.\n\nHe enquired after our families, laughing about “our poor parents” who had raised us with such care just to find we are renegades who only want truth. “There is no you!” We all laughed.\n\nSFH spoke about double perfection and double joy. To see how things connect within the world of cause and effect and exercise the mind in order to most optimally align with them, and then to see with another eye how everything is always already aligned; how there is the touch of perfection within everything, and behind everything, and before everything, and after everything, and right now.\n\nWe can constantly calibrate with this and recharge ourselves with and in silence.\n\nWe cannot deny our humanity: living it fully is the only way to recognise divinity and remember what it is that this whole story is really about.\n\nHaving said this, we stood in silence for a precious and timeless moment on that hill, some palm trees softly swishing behind us, the horizon lit up before us, the first stars blinking through above us, the shining rock smiling at this serenity.\n\nWe slowly turned back and made our way towards the house again. We shared a few more small and perfect words, I complimented the dogs and SFH gave each of us a single pecan he had gathered earlier. It was still warm to the touch.\n\n*“He said: What is the hidden letter? \\\nI said: Knowledge that leads to reality. \\\nHe said: What is the act? \\\nI said: Sincerity. \\\nHe said: What is reality? \\\nI said: That through which you disclose yourself. \\\nHe said to me: What is sincerity? \\\nI said: Toward your countenance! \\\nHe said: What is self-disclosure? \\\nI said: What you encounter in the hearts of your friends.”*\n\n*-- Muhammad Niffari*\n"
  },
  {
    "slug": "/23-08-2020",
    "title": "23 August 2020",
    "description": "Lunch With God",
    "content": "After an interesting and somewhat drawn out attempt at a fish braai with David and Dr Z, we sat down to lunch with SFH today. “Kingklip”, salad, beautiful mango chutney, potatoes, mushrooms and the rest of it. Everything here tastes delicious.\n\nSFH began by joking with Paul: “Here comes a seeker! Will you tell them about your lunch with God?” He would later say that “Paul is a beautiful being, but he hasn't quite yet perfected the art of disappearing. It’s so simple - just disappear!”\n\nThe first, and perhaps most notable, thing he said to me centred around “all these spiritual beings and gurus and shaykhs who want to offer you something.” He emphasised that there is nothing to be offered, nothing to be gained, no benefit to be had from sitting with a so-called teacher. Especially the ones who think they can give you something. Only listen to the One. Only listen to the Voice within your own heart. And you can only do that when you regularly move into silence and practice being there until all your other illusions disappear.\n\nHe told a story about a so-called shaykh in Karachi who had held a gathering with all the top Pakistani government officials. When someone told this shaykh that a Shazzali shaykh had arrived, he began to describe a dream he had had the previous evening where all the great shaykhs had been present with him and The Prophet (pbuh). All the great ones, except for Shazzali, that is. Everyone looked at SFH, expecting a response. Eventually, to break the pregnant silence, he said that this was because Shazzali had gone beyond The Prophet to simply be with God. Then they left.\n\nSpiritual comparisons are meaningless.\n\nThe story is about resonance with the One, Who is boundless and timeless, while you are bound within time. “We are only here for a short while and we get the chance to play a little, move my arm here, say this, look there. It is a beautiful gift, wrapped in humour. If you can’t see this, you become too serious, like Paul over here.”\n\n“We cannot ever express enough gratitude.”\n\nWith these words, a wave of love and a gurgling stream of laughter overflowed in my heart. I was immediately reminded of a moment the night before with Paul, drinking some tea after a divine piece of lemon cake where I had quietly slipped into deeper meditation and dissolved in the presence here. Eventually, I felt a deep green vine with a single white flower grow up and around me from my right foot, and this flower was joy, and it had the same quality of loving humour as this particular meal with SFH.\n\n“So, we must play and enjoy this for the little time we have, because after death there is none of that. After death it is only perfect witnessing.”\n\nLunch ambled on, and SFH gave Paul and I some of his personal blend of perfume. There are no words for what it smells like. In fact, there is nothing left to say.\n"
  },
  {
    "slug": "/24-08-2020",
    "title": "24 August 2020",
    "description": "Light and Dark",
    "content": "Paul and I helped Mary with a Zoom call this morning and then sat in the garden with the dogs and our silence for quite some time. We left briefly to complete *salaat* and then returned to some benches near the pond in the shade. After a while, SFH appeared on his veranda, taking a seat in the sun, clearly out to be quiet and enjoy the birds and soft Lowveld breeze.\n\nEventually, we got up, thought about heading in for our own lunch, but then turned to walk over and greet him. He welcomed us onto his veranda and spoke with us briefly, mostly concerning his desire for us to begin work in line with the research around Quantum Mechanics he had first indicated on our sunset walk.\n\nBefore this, though, he said that the whole business is about learning to stop and go beyond the self. Once you know how to do this, you can have an occupation and a skill and all the rest of it, but “the highest skill is to go beyond the self”. He offered us a condensed version of his cosmogony to illustrate the point, talking about the two zones as they relate, in particular, to the work he wishes us to do and how this links with attaining full consciousness or going beyond the self (these being one and the same thing).\n\nHe himself was sitting half in shade, half in sunlight. Reclining ever so often to get his head into the shade and better see the two of us. He again indicated how no-one, no teacher, no guru can give you anything and how everyone over-complicates this incredibly simple message and practice of self-knowledge. We are both light and shadow, and his very position reclining in that chair halfway between sun and shade illustrated this point most wonderfully, as well as demonstrating his own ease with the simple fact of this.\n\nAfter talking, he invited Paul to show me his balcony - an almost unbelievably tranquil place with beautiful music playing and an atmosphere that will not fit into these few words. He indicated a particular plant growing near where he was seated and spoke about how he chews it each morning as it has many beneficial Ayurvedic properties. I took a close look at the shape of its leaves, trying to imprint it in memory, though I have now forgotten its name. I will have to ask Paul.\n\nLunch was, as ever, delicious and nourishing.\n"
  },
  {
    "slug": "/25-08-2020",
    "title": "25 August 2020",
    "description": "The Ocean of Unity",
    "content": "Paul and I took the dogs for a walk again around sunset, circling the property three times. He pointed out a number of fruit trees to me - jackfruit in particular, as well as taking me into the mango grove. We picked up two avos up from the floor and generally revelled in the abundance of this place. On our third round, we saw SFH and Aaron on their own perambulation and left them to it.\n\nWe went looking for the spotted eagle owls, who nest in a dead tree directly outside SFH’s house, but couldn’t find them on this occasion. We also hung out with some of the blooming flowers in the garden. They remind me somewhat of rose geraniums, but are something different and less fragrant. Paul also can’t remember the name of the ayurvedic plant SFH pointed out, though it seems to grow in the courtyard at Andalus too. I suppose we will just have to accept our floral limitations for the moment and keep appreciating the beauty as best we can.\n\nAs we came round the house on our final perambulation, we found Mary feeding the dogs and Aaron, Alethia and SFH seated quietly in the garden. We greeted Mary and joined the other three. SFH began by talking of the relief encoded in *Allahu akbar*, and what it is to accept and submit to this cosmic declaration, knowing that it is always already greater than anything you can know or think.\n\nOf course, to realise and live this, rather than just hold it as an idea in your mind, requires work: the so-called grooming of the self. Everyone will experience this to the degree appropriate in their life and, even if you don’t realise it while living, you will after death. So don’t worry too much, but balance this with whatever work you can handle, ever seeking subtler shades of self-knowledge.\n\nSFH then began to talk about his current investigations, which have to do with a number of *ayat* in the Qur’an on the topic of *shirk*, which is “the dark side of *tawhid*”: seeing anything other than Oneness at any time. With deeper shades of self-knowledge comes appreciation of the lights which create them, and then the lived experience of their total lack of separation. It is One.\n\nWe then just spent some time relaxing together. Mary joined the party and we talked about the dogs and various other ordinary and wonderful things. Alethia even interrupted SFH at one stage, which surprised me, but it was also entirely delightful to see him as a man, relaxing with some close friends, rather than only as a teacher, demanding that everyone listen.\n\nAt one stage, Aaron took Paul and I to look for the owl again, which we did, but were still unable to spot either male or female. SFH had been speaking at lunch two days ago about how their language changes when they’re courting, which is currently underway, and he seems to stand on his veranda and engage them in active conversation - something I find both amusing and profound. They are such amazing birds, and it is a testament to the nature of this place that they are so comfortable with nesting right next to where he lives.\n\nEventually Aaron and Mary left to attend to their respective duties, and SFH said a few more words to us. The dogs were getting a bit rowdy and we were seated on the floor, so all I remember of that particular burst was that it was a continuation about only seeing Oneness and *Nur al an-Nur*: light upon light, which seemed entirely appropriate given the way the half-moon and light from the house behind us was reflecting off the dog’s glossy fur, the ridge - as Aaron had pointed out - like an alif right down the middle of their backs.\n\nSFH then rose to leave, we rose to greet him, and he shared a little bit more information about some street vendors nearby whom we should visit to buy some fruits: they are apparently the only people he buys from. He noted, in particular, their faith and trust.\n"
  },
  {
    "slug": "/26-08-2020",
    "title": "26 August 2020",
    "description": "Birthday Cake",
    "content": "It was Alethia’s birthday today, so we went up to the house in the early afternoon to have some truly decadent chocolate pistachio cake Mary had made. Generally, SFH rests in the afternoon, so I wasn’t expecting to see him, though everyone was gathered in the living room when we got up there.\n\nSFH was joking with Alethia about her having just died, and being immortal, and about some of her previous escapades, which he labelled as “Alethia’s Folly, or Al-F”. It made me smile at the sound of words and their meanings - another slant on the *alif* of the previous evening from the dog's back. It set me wondering about roots and routes again, and all the linked neurological, physical, chemical, psychological, sociological paths we tread in this short life we are given.\n\nSFH had some other things to say, but I must admit that I can’t remember exactly what they were. Sometimes one must simply be overwhelmed and face it with honesty. In truth, every moment is entirely overwhelming, with the eternal occurrence and recurrence described by Ibn ‘Arabi: the ceaseless creation and destruction; birth and death; quantum particles popping into existence with energy borrowed from the future (the measurement of which affects the past), meeting and annihilating each other so as to reduce back into neutrality again.\n\nEither way, after he had left and we had finished coffee and cake, Mary opened up a bit about essential oils. I also asked her about those flowers in the garden - they’re not geraniums, but azaleas. She told the story of how she became involved in essential oils, which was really through Elizabeth. She got into the story of Abu-l-Kasim al-Zahrawi and the empire of the three religions and various fascinating stories about Cordoba and Spain more generally, emphasising how many of al-Zahrawi’s preparations were used to dye skin and hair colour in an attempt by the lighter locals to appear more like their “Moor overlords”.\n\nShe also told a story of her interest in perfume more generally, talking about a specific interaction she had had with Edmond Roudnitska, walking through his garden talking about Lily of the Valley among other things. He recommended to her that the perfume she was working on - Zahra - be finished off with tuberose. She talked further about perfumery as - in some sense - equivalent to writing a symphony, with base, middle and high notes and how to craft it to the specific needs of the individual in front of you.\n\nI asked her about the effect of different oils on our neurology, my interest having been stoked by Lyall Watson’s book *Jacobson’s Organ*. This organ has more to do with odourless pheromones and is connected directly to parts of the brain which the olfactory system is not, but Mary detailed some of the basics instead, which I was very grateful for anyway. In particular, she cited Lavender as a good example of the sort of subconscious effects smell can have: many men like it because it conjures up homeliness, care, safety and security for them, whereas many women do not, because the same associations for them signify imprisonment.\n\nShe also pointed out that rosemary is great for circulation in the brain; and peppermint and lemon for freshness (especially when doing repetitive tasks: they use peppermint on assembly lines in Japan, apparently). She then told a brief story about some of her work on oils for drug and alcohol abuse facilities, noting especially a mix she made of Vetiver (known as tranquillity oil in Sri Lanka), Frankincense (Loban, great for dealing with dispersion) and some kind of Sage (a euphoric, called “the marijuana of the essential oils world”) which seemed to be particularly effective.\n"
  },
  {
    "slug": "/27-08-2020",
    "title": "27 August 2020",
    "description": "Owls, Omsapoortie, and Macadamias",
    "content": "Paul and I went on an early evening walk through the macadamia groves here - it was great to be out and about, though Paul seemed to be in a bit of a rush and we walked briskly through the bigger-than-expected plantation.\n\nWe then went across to the farm and walked almost directly into Alethia and SFH. SFH gave each of us some white blossoms he had picked which he said we could eat. They smell heavenly, and taste OK, though I think definitely better to breathe in than consume. Then he pointed upwards into the tree where both Spotted Eagle Owls were sitting, watching these strange humans with detached interest.\n\nHe distinguished between the male and female (who is bigger) and talked a little bit about how he thinks they’re finally getting ready to nest. He chuckled when talking about how the male had tried the previous evening, and the female had seemed kinda into it, but then had flown away with these “big eyes”, mimicking her uncannily.\n\nAlethia then took a call and SFH, Paul and I walked out in the wider gardens. He took us to a specific tree on the property which he called “Omsapoortie”, though I cannot find any reference to such a thing online. He said it was a kind of South American fruit tree, and pointed out the fruits (which are all still green at this time of year). Paul said they are something like custard pears, or a cross between apples, mangos and avocados. Sounds heavenly. SFH said there used to be 4 on the property, but now there is just one left.\n\nSFH then had us gather some macadamias lying on the floor beneath some of the other trees to take back to his veranda so he could show me how to crack them. As we walked back, he spoke about this world being the “second womb”, after the mother’s womb. We are here to learn in this nursery all the different forces of consciousness, all the pushing and pulling so that we might perfect our surrender and prepare for the pure witnessing he spoke about previously.\n\nHe reflected on the work he has asked us to do, speaking about how these scientific models can help people overcome the superstition and tendency towards embellishment that you find in religious narrative. We all like to mythologise.\n\n“We’re always after power, and this has been the West’s great downfall. No respect for the life we all share: it’s all about my life and your life and their life. It is just life!”\n\nWe must keep finding clear, simple and direct means of expressing this so as more people can come to live it, even if they are not raised with this awareness in their culture. The scientific model is a good one for this, but only when coupled with “reverence for the Absolute”. I can’t quite describe what it felt like to hear those words from his mouth: it is a truly lived experience.\n\nBy this stage, we had made it back to his balcony and he had me sit down right where he cracks macadamias. He joked about his “high tech, laser setup” which consists of using the gaps between the floor tiles and a big, flattened stone which fits perfectly into the palm. He asked Paul if he should take me on as an apprentice, to which Paul (bless his heart) responded in the affirmative.\n\nThe first nut I cracked I did a little too hard, but I got the second one right. These ones had been drying for a few days in the sun, which makes cracking them easier, though the ones we had gathered still have a lot of moisture in them, and the kernel presses right up against the shell. Strangely enough, the really fresh ones seem to have a hint of a coconut taste to them, which SFH commented on.\n\nWe fed a few to the dogs, who are apparently mad for macadamias, and then just sat in bliss. SFH spoke a little bit more about the work and the overall, simple package he wants to produce which can be passed from person to person. It is paradise to be with this man. There is no need to say anything, no questions spring to mind, no desire for anything but to live each moment I get with him fully and in total presence.\n\nMary joined us and we spoke a little about the dogs, and all the people that have been here today, and America and various other light topics. Again though, it was just the joy of being together which overwhelmed all other considerations.\n"
  },
  {
    "slug": "/28-08-2020",
    "title": "28 August 2020",
    "description": "Jackson's Grapefruit and Rose Geranium",
    "content": "Paul and I went for another evening walk after a day of reflection and work and literally the best crumble and custard I have ever had for lunch. Mary continues to outdo herself. We were a little bit later today on account of all these Jim Al-Khalili documentaries we’re watching for the Quantum Mechanics work, but soon ran into SFH, Alethia and Aaron on their own stroll. We joined them.\n\nSFH was talking about how anything we do for others is really an act for ourselves. This links to honesty in a deep way: after all, what is the other but a mirror for the self? Alethia and Aaron joked with Paul about being “Mahaguru”, which I think is hilarious. It was just another completely joyous meeting.\n\nWe walked for some time together, and SFH pointed out a White (or Jackson’s) Grapefruit tree, which he told me to pick a few fruits from. The first I gave to Paul, and then I took one for myself, which I offered to SFH who took it, held it for a moment and then returned it. Aaron also picked a few, so we now have a bunch of these amazing fruits in our kitchen.\n\nSFH talked at length about, in particular, the antibacterial properties of the seeds and how they’re increasingly used in all kinds of modern medicines, even in the West. He said, “The next generation is already protected to ensure it will grow as the fruits pass on.” This struck me as a particularly powerful and profound metaphor.\n\nWe walked a little further and admired Jupiter and the waxing moon, which are in increasing alignment. I remembered my dad talking about how this alignment between Saturn, Jupiter and the Moon only happens once every ~40 years. Alethia and Aaron seemed confused about whether Jupiter was a planet, star or satellite, but asked Google as is the modern trend. My concern is simply being fully present with SFH. These times together are unspeakably full.\n\nWe walked on, and he spoke a little about how close to Kruger this place actually is - 20km as the crow flies - and asked about the duikers who tend to hang out around Andalus. We eventually ended up on his veranda again and he showed me how to cut one of the grapefruit most efficiently. You put the head (where it connected to the stem) downwards and cut it in half from the bottom. Then into quarters, and use the leptin gathered at the head to peel the quartered section easily. It was entirely delicious.\n\nWe just stood around speaking about this and that. Most of the conversation centred on essential oils and the perfume industry. SFH had stressed yesterday how he tries to only use South African oils, and was lamenting the fact that the international markets - Europe especially - tend not to. Apparently, South African farmers are not reliable or consistent enough, though the wealth of flora and the amazing conditions in this country make it a perfect place for growing.\n\nHe mentioned, in particular, that South African lavender is considered too strong in the perfume world, so it gets labelled lavendine and given a low grade. He also mentioned Karen Swanepoel (who Mary knows well) and Denzel Phillips, both of whom are experts in the field. Karen had got hold of 5kgs of some really special South African Rose Geranium, which Mary had bought. SFH had a small bottle of it, which he fetched and doused all of us in. The scent is genuinely remarkable. As is so often the case in this man’s presence, words fail to even come close to what it really is.\n\nEventually, we all went our different ways, and Paul, Alethia and I ended up on the benches in the garden absorbing each other’s presence and the atmosphere of the farm. Alethia shared some amazing and surprising music, which prompted Paul to share some of his own, and we just sat in bliss saying a few things every now and then, but mostly just loving the feel of being with like-hearted human beings.\n"
  },
  {
    "slug": "/29-08-2020",
    "title": "29 August 2020",
    "description": "Tea on the Veranda",
    "content": "I did *Asr* today as a few drops of rain began to fall. My intention was *rahma*, which an old friend had told us to be careful about. *Rahim* (directed mercy) is gentle, but *rahman* is majestic. I felt I didn’t really have a choice though - it was literally raining *rahma* in the dry Lowveld winter and, though I felt a kind of fear, it was entirely right. I put my head down for the final *sajda* and the rain, which had been on and off serendipitously through the whole prayer, returned. I cried and cried and cried and cried. This mercy is beyond even music. It is.\n\nAfterwards, I went up to “play” with Alethia and Paul. We had a long and relaxed conversation in her living room. Nothing special, and therefore entirely extraordinary. It is, again, such a joy to spend time with these two wonderful people.\n\nWe then went for a walk just as the sun was setting. It had been overcast most of the day, but - as we walked out - the red orb of the sun made a perfect appearance before the last line of clouds above the horizon veiled it again as we rose into the night. Paul went to give Mary some dishes back - our food supplies are overflowing - and Alethia, David and I headed to SFH’s balcony. I asked her what the name of that Ayurvedic plant is, but she wasn’t sure, though we tasted it together. It is familiar, yet I am also sure I’ve not had it before.\n\nAs we were doing this, SFH came out and told me again - what patience! - that it is called gotu kola. Considered a weed by many, you will not find an ashram without it growing somewhere. When asked if he would like to take a walk with us, SFH said he would prefer tea on his balcony. David and I went to sit on SFH’s balcony and Alethia went to make tea. SFH joined us and Alethia returned with the most delicious herbal, honey-infused tea. I have no idea what was in there, but whatever it was is heavenly.\n\nSFH complimented Alethia, saying she is the person he knows who has worked most with the Qur’an. This is high praise indeed from him. He mentioned to her a small project he wants her to do about 15-20 *ayat* only to give the essential heart of the Book of Reality. They mentioned a few from Sacred Alchemy, Alethia said one in Arabic and SFH mentioned “You cannot give God a true measure” and then another in Arabic. Hearing these words spoken by people so intimately familiar with so many layers of their meaning is another experience beyond the reach of English.\n\nSFH used the *ayat* about measurement to talk about how “None of this (indicating the farm, and our current situation, and just everything) could have been engineered. It is just the flow of *baraka*. No-one is in control.” He leaned back and raised his hands in surrender and said a sentence I will never forget: “Hands empty; heart overflowing.” *Subhanallah*.\n\nPaul and Aaron joined us after a brief walk around the property and we began a very companionable and laid-back sharing of various stories. Aaron told a story about driving a ahaykh in Pakistan as a young man and asking him something specific about Ibn Arabi. The shaykh had looked at him and said, “What does this mean to you!? You’re too young to be asking this question, and if you could read it properly, you wouldn’t need to ask me anyway!” He said his ears still turn pick at the remembrance of this harsh (and loving) slap. Memory is such a funny thing.\n\nAlethia shared a vision she had had of this same shaykh, or more specifically his crooked finger, pointing at her and commanding her to “do the books”. I think she has done admirably in this regard. She also seems to think that that crooked finger is no longer pointing, or at least not in an accusatory or prescriptive way, anymore.\n\nThe dogs had joined us with Paul and Aaron. SFH told Alethia to put her fingers on Zita’s eyes and “send a beat of love into her heart”. I was also touching Zita at this point and - again - words fail to capture what this felt like, what it is to let go completely and let a field like love flow through you, into you, out of you. No you!\n\nThis reminded SFH of a story about a Asian sufi called Ibrahim ibn Adam, who had been asked about *adab* (courtesy) especially around giving. Others had been saying that they give a lot when they have a lot, and less when they themselves are struggling. When it came to be his turn, he said that this kind of generosity was what their dogs practised. For him and his people, “When we have nothing, we give it all. When we have an abundance, we abstain, for we know it is God’s test upon us.”\n\nToday is *Ashura* - the day of Imam Husayn’s martyrdom in Karbala. Last night, I attended Aaron’s Sufi music circle, which had to do with many of the songs, laments and poems around this particular event. The 10th day of Muharram is supposedly a day when many such momentous situations have come to pass: the arc of the covenant, Noah’s flood etc. SFH mentioned that, really, both Husayn and Yazid are in every human heart, and you must choose which to resonate with. Paul had shared some Husayn quotes with me earlier in the day, all of which are deeply powerful.\n\nThe conversation meandered on a bit after all of these amazing gems, until SFH dismissed us as it was time for *salaat*. Aaron and I went to do ours in the prayer room here. What an incredible man to pray with. What an incredible place to put your head down and die. Every place is sacred, but the miracle of differentiation somehow still bestows a special honour on places and times like this one. I do not understand this.\n\nPaul joined us, and we did *Isha* together as well. The room smells amazing as it is, but some neroli (orange blossoms) from the Seville orange trees here had been laid out on a mat behind us. They have a unique and intoxicating aroma. Aaron then invited us over for some coffee, Paul went to fetch something, and Aaron showed me the pictures of many of the Shazzali shaykhs in the room adjoining the prayer room. You can still see the light pouring out their eyes.\n\nAaron also taught me another *jalal* (refrain) from one the *dhikrs* in “Path to Light”, which he said the Wali of Balil had always sung. Luna appeared (who happens to know a lot about this particular man, having met him in Morocco as a small girl, in the town where he lived outside Fez). We sang the *dhikr* as we walked towards their home, where we ended up having an amazing dinner instead of just coffee.\n\nLuna cooked whitebait, and curried potatoes, and an experiment with trout miso, and she even had a lamb korma for me (because I had mentioned that I cook a fairly decent butternut korma), inspired by Aaron’s mother. It was beyond amazing. I still have so much to learn.\n\nMama Zee joined us for dinner too, and shared many of her own stories and photographs of both her as a young child, her and SFH as twenty-something students (so amazing to see them both at that age!), and various members of the family. The conversation moved around SFH’s father, mother, and uncle (who was a sufi) and various stories from all their lives together.\n\nStrikingly, Mama Zee told a story about Sufi Barkat Ali calling her his “spiritual mother” and Swami Chinmayanada asking her to stay on with him and teach the children. Later, Luna and her revealed that it was actually her influence and interests which led SFH back to Sufism and Islam. It’s always the women: this is as profound to remember as the rest of this amazing day.\n\nLuna and Aaron talked about some of the places they’ve travelled (the list is extensive) and the different foods from all the different regions, as well as the fusion between them all. Though I couldn’t contribute much to all this, it is simply a great honour to be present with these beings. I helped Luna with the washing up after dinner and heard about her thesis, which is about Transmission between teacher and students, using SFH as a living case study. It sounds fascinating, and she seems like the perfect person for such a vast project.\n\nWe retired to the living room and carried on talking in the same relaxed atmosphere. It was a somewhat meandering conversation, which I found immensely pleasurable. In particular, Paul said that he thought Aaron’s spirit animal was a bear, which Luna latched onto, saying that she thinks he is really a Himalayan honey bear (which is entirely hilarious), that she is a lioness, and Mama Zee is a polar bear. What an incredible family this is.\n\nEventually, we parted ways, and Paul and I returned to Andalus. We shared some tea, and sang a soft *dhikr* on the upstairs balcony. It was a moment far beyond beauty.\n\nHands empty; heart overflowing.\n"
  },
  {
    "slug": "/30-08-2020",
    "title": "30 August 2020",
    "description": "Croissants and Code",
    "content": "No meeting with SFH today, but things continue to unfold in unexpected and delightful and challenging ways. David brought croissants over this morning for breakfast. It’s funny how Paul tries to avoid him - I suppose that some of his preaching can get tiresome once you’ve known him for a longer time. Still, it seems strange to speak badly of others, particularly other close students on your path.\n\nI enjoyed what he had to say about the fractal nature of trees and lightning and the veins in our body and how the kind of self-similarity behind all of these natural structures hints very directly at an underlying pattern. He also said the most beautiful thing to me, a quote he had remembered from somewhere:\n\n*\"Love what you love \\\nin moderation \\\nfor it may become what you hate. \\\nHate what you hate \\\nin moderation, \\\nfor it may become what you love.\"*\n\nWe discussed how intimate and impersonal the whole thing is, which left us both stunned and silent and singing joyously simultaneously.\n\nLater in the day, I went to visit Mary and we worked a little more on the website. I think we’ve found a great picture for the “About” page, and a slowly improving structure for the videos section. We’re also working on a callout style for short aphorisms or sayings from SFH, so that we can weave a golden thread of his living words through the whole thing: an idea I deeply resonate with. It’s an honour to spend time with Mary: she has such presence and poise, and is full of strange and wonderful stories. She also said she’d give us some of the rose geranium oil SFH doused us with yesterday. Like I said: it is unexpectedly delightful here.\n"
  },
  {
    "slug": "/31-08-2020",
    "title": "31 August 2020",
    "description": "Mama Zee's Blue Eyes",
    "content": "Today, Paul and I had lunch with Mary, Luna and Mama Zee. I sat next to Mama Zee. It’s beautiful to be near her. The conversation over lunch was mostly between Luna and Mary - Luna was asking for the names of various Sufis throughout history who fit particular stereotypes in the Western mind for her thesis work. Many names I am somewhat familiar with were mentioned: Niffari, Shibli and Hallaj (from Paul, of course), Abdul Khadr (all 3 of them), Omar Khayyam, Rumi, Rabia, Imam Jafar Sadiq and many others whose names elude me now. It’s such a fascinating and revealing lens through which to look at history.\n\nAs the plates were being cleared, Mama Zee began to share some more of her stories about childhood, WWII in Denmark, and various people she had met in her life and experiences she had had along the way. What an incredible life it has been; and yet she still questions why human beings act in the ways they do; why we can be so violent and hurtful, rather than peaceful and helpful; why we can never quite seem to pull it all together. I suppose there really is no end to our not-knowing. What a mystery. What a relief!\n\nShe also extended her story about going to Mecca to shout at God when SFH decided to take another wife. In this telling, she described how she had felt her heart get taken out of her chest and washed in light. To hear her say these words and to feel her sincerity is an experience I will never forget.\n\nThat said, it wasn’t so much the stories, but her eyes that captivated me today. Though she is old, her eyes are electrically, vivifyingly, entrancingly blue and clear and ageless. The light is sometimes overwhelming, but with her it is both direct and maternal and I have sat here now for many minutes and cannot even begin to fathom what else to say about her piercing blueness.\n\nGod bless her, and God bless Luna and Mary, and God bless all women for their strength and gentleness.\n\n*“He said: What is the gaze? \\\nI said: One of the properties of identity. \\\nHe said: What is identity? \\\nI said: You, Allah. \\\nHe said: You have spoken the Real. \\\nI said: You spoke through me. \\\nHe said: Behold my bliss.”*\n\n*-- Muhammad Niffari*\n"
  },
  {
    "slug": "/introduction",
    "title": "Introduction",
    "description": "What is the nature of transmission? How do we learn from great teachers?",
    "content": "This book consists of a series of diary entries made between August and November 2020.\n\nSouth Africa was gradually coming out of lockdown as a result of COVID. Everything was strange and new.\n\nI was invited to the home of a Sufi shaykh to work on a new website and some books he was busy writing. I kept a diary of as many of the events of the first two weeks as I could. I had no intention of sharing what I experienced: it was simply in my heart to record as accurately the nature of my experiences given how particular and surprising many of them were.\n\nThese entries have lain quietly to one side for the last four years. My heart now compels me to put them in a more open place. I have re-read them with fondness and a soft smile for the naïveté they often display. Creating this site is, in a way, part of my practice of compassion applied in and across time. I am such an idiot, but I keep faith that there is in everything a special fondness for God's idiots.\n\nThe Book of Guidance is a long-abandoned project of the shaykh's, with which I intended to help. I have placed these diary entries on this domain because it occurs to me that there is a great deal of guidance in them, both in the form of what not to do, as well as intimated in some of the direct quotes still held secure in the text.\n\nI invite you to read them with lightness and affection, both for yourself, and for everyone around you who is struggling to understand what life is all about and how they can live it well. We are all doing our best.\n\n***\n\nThere are three remarks I wish to make, looking back on the time held in these entries.\n\nFirst, I changed all the names. It feels like the correct way to approach making these entries more open.\n\nSecond, SFH will continually call out to you, highlighting how there is no need for teachers, gurus, or shaykhs. Yet, the text is really all about one such teacher, guru, shaykh. How to untangle this performative contradiction? I don't intend to. Like Rumi's chickpeas, I will let you cook in it, as I have been cooking in it. Transmission - somewhat irrespective of tradition or culture - has always occurred between teacher and student. It has been a critical structure for passing on what can't be passed on. Permission, accountability, conduct, respect, and shared understanding have depended upon the teacher-student structure for a long time. That said, I sense that something important about this archetypal structure is changing. Thich Nhat Hanh says the next Buddha is the Sangha. SFH says that the teacher-student, shaykh-murid structure is no longer as useful. A framework for understanding what this looks like in shared reality can be [found here](https://www.kernel.community/en/learn/module-metta/). An attempt to understand the inner implications can be found [here](https://libraryofbabel.info/bookmark.cgi?findingsufficiency).\n\nThird, a word about what I mean when I say \"transparent\", because it took me a long time to remember. A part of it is the traditional meaning of being open and honest without secrets, but it goes much deeper than this. The moments I recorded a feeling of being transparent were not just about feeling that everything was an open book, but also that there was simple, uninterrupted flow. It is beyond light and darkness: it is about a state of being in which even light passes through without reflection. Years later, I would find names for it in other traditions; names like [*tadvanam*](https://www.youtube.com/watch?v=L5qNi_R95Q0). It would be sparked on different visits to the farm by studying Arabic words like [*naslakhu*](https://quran.com/36/37): how day is peeled from night as a thin veneer covering a much larger, \"dark\" reality would be (where \"dark\" means something more like \"dark energy\" or \"dark matter\" rather than just \"ignorance\"). If you reflect on the dream described in one of the later entries and the way balance is represented, perhaps you can get a sense for what I mean when I talk about being transparent.\n\nMay these words guide you as I have been guided.\n"
  }
]